public/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Duncan Britt</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/stylesheets/page.css"/>
<link rel="stylesheet" type="text/css" href="/stylesheets/layout.css"/>
<link rel="stylesheet" type="text/css" href="/stylesheets/color-scheme.css"/>
<base target="_blank">
</head>
<body>
<div id="preamble" class="status">
<header>
    <nav>
        <a target="_self" href="/">About</a> -
        <a target="_self" href="/blog-posts.html">Blog</a> |
        <!-- <a target="_self" href="/portfolio.html">Portfolio</a> -         -->
        <!-- <a target="_self" href="/contact.html">Contact</a> - -->
        <!-- <a target="_self" href="/resume.html">Resume</a> | -->
        <a target="_blank" rel="noopener noreferrer" href="https://duncan-britt.github.io/splice-docs">Splice</a> -
        <a target="_blank" rel="noopener noreferrer" href="https://word-ladders.herokuapp.com/">Word Ladders</a>
        <!-- <a target="_blank" rel="noopener noreferrer" href="https://github.com/Duncan-Britt/">GitHub</a> -
             <a target="_blank" rel="noopener noreferrer" href="https://www.codewars.com/users/Duncan-Britt">Code Wars</a> -->
    </nav>
</header>
</div>
<div id="content" class="content">
<h1 class="title">Duncan Britt</h1>

<div id="outline-container-org8e1b6bf" class="outline-2">
<h2 id="org8e1b6bf"><b>Computer Science Student</b> - Denver, CO</h2>
<div class="outline-text-2" id="text-org8e1b6bf">
<p>I'm in my final semester at Arapahoe Community College before graduating with an Associate of Science and transferring. I'm also employed as a tutor of physics and mathematics. I'm currently working on <a target="_self" href="/blog/autonomous-mobile-robot/autonomous-mobile-robot.html">building an autonomous mobile robot.</a></p>
</div>
</div>


<div id="outline-container-org44da4d0" class="outline-2">
<h2 id="org44da4d0"><b>Highlighted Projects</b></h2>
<div class="outline-text-2" id="text-org44da4d0">
<ul class="org-ul">
<li><p>
<a href="https://duncan-britt.github.io/splice-docs/">Splice</a>:
</p>
A templating language for front-end web development - 
<a target="_self" href="/blog/splice/splice.html"> article</a></li>
<li><p>
<a href="https://word-ladders.herokuapp.com/play">Word Ladders</a>:
</p>
Software generated word-ladder puzzle game -
<a target="_self" href="/blog/software-generated-word-ladder-puzzles-and-web-app/software-generated-word-ladder-puzzles-and-web-app.html"> article</a></li>
<li><a href="https://github.com/Duncan-Britt/Assignment-Tracker#readme">Assignment Tracker</a>: To-do list app with query language interface.</li>
<li><a href="https://github.com/Duncan-Britt/Tic-Tac-Toe#readme">Tic-Tac-Toe</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb9cb1c" class="outline-2">
<h2 id="orgeb9cb1c"><b>Links</b></h2>
<div class="outline-text-2" id="text-orgeb9cb1c">
<ul class="org-ul">
<li><a href="https://github.com/Duncan-Britt/">Github</a></li>
<li><a href="https://www.codewars.com/users/Duncan-Britt">Code Wars</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgdce420c" class="outline-2">
<h2 id="orgdce420c"><b>Skills</b></h2>
<div class="outline-text-2" id="text-orgdce420c">
<ul class="org-ul">
<li>C, C++, JavaScript, Ruby, HTML, CSS <label>Languages</label></li>
<li>Sinatra, SQL <label>Libraries, Frameworks & DSLs</label></li>
<li>Git <label>Technologies & Tools</label></li>
</ul>
</div>
</div>

<div id="outline-container-orga2d8e31" class="outline-2">
<h2 id="orga2d8e31"><b>Contact</b></h2>
<div class="outline-text-2" id="text-orga2d8e31">
<p>
Email: My initials + ru997 at gmail
</p>
</div>
</div>

<div id="outline-container-org1ff381f" class="outline-2">
<h2 id="org1ff381f"><b>Resume</b></h2>
<div class="outline-text-2" id="text-org1ff381f">
<p>
<a href="documents/Duncan_Britt_Resume.pdf">PDF Download</a>
</p>
</div>
</div>
</div>
</body>
</html>
